Hi Guys,<br>
Welcome back to the pandas essentials, now we are going to talk about the missing data!<br>
## Handling Missing Data
Missing data is very common in many data analysis applications. pandas has a great ability to deal with the missing data. <br>Let's learn some convenient methods to deal with **missing data in pandas**:<br>

* isnull(), isna(), notnull(), dropna(), fillna(),

In [3]:
import numpy as np
import pandas as pd

In [4]:
data_dic = {'A':[1,2,None,4,np.nan],
            'B':[np.nan,np.nan,np.nan,np.nan,np.nan],
            'C':[11,12,13,14,15],
            'D':[16,np.nan,18,19,20]}
df = pd.DataFrame(data_dic) 
df

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12   NaN
2  NaN NaN  13  18.0
3  4.0 NaN  14  19.0
4  NaN NaN  15  20.0


**isnull(), isna(), notnull() -- Check for missing data in the dataset!**

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       3 non-null      float64
 1   B       0 non-null      float64
 2   C       5 non-null      int64
 3   D       4 non-null      float64
dtypes: float64(3), int64(1)
memory usage: 292.0 bytes

In [6]:
df.isnull()

       A     B      C      D
0  False  True  False  False
1  False  True  False   True
2   True  True  False  False
3  False  True  False  False
4   True  True  False  False

In [7]:
df.isnull().sum()

A    2
B    5
C    0
D    1
dtype: int64

In [8]:
df.isnull().sum().sum()

8

In [9]:
df['A'].isnull()

0    False
1    False
2     True
3    False
4     True
Name: A, dtype: bool

In [10]:
df['A'].isnull().sum()

2

In [11]:
df.isna()

       A     B      C      D
0  False  True  False  False
1  False  True  False   True
2   True  True  False  False
3  False  True  False  False
4   True  True  False  False

In [12]:
df.isna().sum().sum()

8

In [15]:
df.loc[2].isnull().sum()

2

In [16]:
df.notnull()

       A      B     C      D
0   True  False  True   True
1   True  False  True  False
2  False  False  True   True
3   True  False  True   True
4  False  False  True   True

In [ ]:
df.shape

In [17]:
df.notnull().sum()

A    3
B    0
C    5
D    4
dtype: int64

In [18]:
df.notna().sum()

A    3
B    0
C    5
D    4
dtype: int64

In [19]:
df.notnull().sum().sum()

12

In [20]:
df

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12   NaN
2  NaN NaN  13  18.0
3  4.0 NaN  14  19.0
4  NaN NaN  15  20.0

In [21]:
# Sum on Column "A", (NaN as 0)
df['A'].sum()

7.0

&#9758; NaN ignored for mean().

In [22]:
df['A'].mean()

2.3333333333333335

In [23]:
df.loc[3].sum()

37.0

**dropna(), fillna() -- Cleaning / filling the missing data**

In [28]:
df.dropna(axis=0)

Empty DataFrame
Columns: [A, B, C, D]
Index: []

In [25]:
df

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12   NaN
2  NaN NaN  13  18.0
3  4.0 NaN  14  19.0
4  NaN NaN  15  20.0

In [29]:
df.dropna(axis=1)

    C
0  11
1  12
2  13
3  14
4  15

In [27]:
df

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12   NaN
2  NaN NaN  13  18.0
3  4.0 NaN  14  19.0
4  NaN NaN  15  20.0

thresh : int, default None
thresh = 3 means, it will drop any column that have less than 3 non-NaN values.

In [30]:
df.dropna(thresh=3, axis=1)

     A   C     D
0  1.0  11  16.0
1  2.0  12   NaN
2  NaN  13  18.0
3  4.0  14  19.0
4  NaN  15  20.0

We can use fillna() to fill in the values.<br>
inplaced = True for permanent change.

In [32]:
df.fillna(value=2)

     A    B   C     D
0  1.0  2.0  11  16.0
1  2.0  2.0  12   2.0
2  2.0  2.0  13  18.0
3  4.0  2.0  14  19.0
4  2.0  2.0  15  20.0

In [31]:
df

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12   NaN
2  NaN NaN  13  18.0
3  4.0 NaN  14  19.0
4  NaN NaN  15  20.0

Let's fill in the values using mean of the column.

In [33]:
df['A'].fillna(value = df['A'].mean())

0    1.000000
1    2.000000
2    2.333333
3    4.000000
4    2.333333
Name: A, dtype: float64

In [34]:
df

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12   NaN
2  NaN NaN  13  18.0
3  4.0 NaN  14  19.0
4  NaN NaN  15  20.0

In [35]:
df.fillna(method='ffill')

C:\Users\dell\AppData\Local\Temp\ipykernel_7844\3524271710.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill')

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12  16.0
2  2.0 NaN  13  18.0
3  4.0 NaN  14  19.0
4  4.0 NaN  15  20.0

In [36]:
df

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12   NaN
2  NaN NaN  13  18.0
3  4.0 NaN  14  19.0
4  NaN NaN  15  20.0

In [37]:
df.fillna(method='bfill')

C:\Users\dell\AppData\Local\Temp\ipykernel_7844\2831856154.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='bfill')

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12  18.0
2  4.0 NaN  13  18.0
3  4.0 NaN  14  19.0
4  NaN NaN  15  20.0

In [38]:
df.fillna(0)

     A    B   C     D
0  1.0  0.0  11  16.0
1  2.0  0.0  12   0.0
2  0.0  0.0  13  18.0
3  4.0  0.0  14  19.0
4  0.0  0.0  15  20.0

In [39]:
df

     A   B   C     D
0  1.0 NaN  11  16.0
1  2.0 NaN  12   NaN
2  NaN NaN  13  18.0
3  4.0 NaN  14  19.0
4  NaN NaN  15  20.0

In [ ]:
from sklearn.impute import SimpleImputer

In [ ]:
df2 = df.copy()
df2

In [ ]:
imputer = SimpleImputer(strategy='constant', fill_value= -1) 
df2['A'] = imputer.fit_transform(df2[['A']])
df2

In [ ]:
df2 = df.copy()
imputer = SimpleImputer(strategy='mean') 
df2['A'] = imputer.fit_transform(df2[['A']])
df2

In [ ]:
df

In [ ]:
df2 = df.copy()
imputer = SimpleImputer(strategy='median') 
df2['D'] = imputer.fit_transform(df2[['D']])
df2

In [ ]:
data_dic = {'A':[1,2,np.nan,4,np.nan],
            'B':[np.nan,np.nan,np.nan,np.nan,np.nan],
            'C':[11,12,13,14,15],
            'D':[16,18,np.nan,19,18]}
df2 = pd.DataFrame(data_dic) 
df2

In [ ]:
imputer = SimpleImputer(strategy='most_frequent') 
df2['D'] = imputer.fit_transform(df2[['D']])
df2

In [ ]:
from sklearn.impute import KNNImputer

In [ ]:
df2 = df.copy()
df2

In [ ]:
knn_imputer = KNNImputer(n_neighbors=2, weights="uniform")
A1 = knn_imputer.fit_transform(df2)
A1

In [ ]:
df2 = pd.DataFrame(data = A1, columns=['A','C', 'D'])
df2

In [ ]:
df

In [ ]:
# fill with you own given value
df.fillna(0, inplace=True)

In [ ]:
df

# Good Job!